*-------------------------------------------------------
* Project.........: eco486.pjx
* File............: eco486.prg
* Module/Procedure: eco486()
* Called by.......: <NA>
* Parameters......: <tcCommand>
* Returns.........: <none>
* Notes...........: Драйвер для терминала ECO 486
*------------------------------------------------------------------------------
LPARAMETERS tcCommand

*04.08.2003 21:03 ->Переменные прекомпиляции
#DEFINE	LOC_DRV_NAME	[ECO486.APP]
#DEFINE LOC_VERSION		[1.0.0.0]
*------------------------------------------------------------------------------

*08.09.2005 17:19 -> При запуске без параметров - выведем информацию о версии
IF TYPE([tcCommand])#[C]
	tcCommand = [VER]
ELSE
	tcCommand = UPPER(ALLTRIM(tcCommand))
ENDIF
*------------------------------------------------------------------------------

*08.09.2005 16:36 -> Выполняем указанную команду
DO CASE
	CASE tcCommand == [VER] &&информация о версии

		*08.09.2005 16:34 -> Сообщим номер версии
		RETURN LOC_VERSION
		*------------------------------------------------------------------------------

	OTHERWISE

		*08.09.2005 16:32 -> Ругаемся
		MESSAGEBOX(LOC_DRV_NAME+[(]+LOC_VERSION+[): Неверная команда или данная команда не поддерживается данной версией драйвера!],48,[Предупреждение...])
		*------------------------------------------------------------------------------

ENDCASE
*------------------------------------------------------------------------------

*******************************************************************************
******************************** END PROCEDURE ********************************
*******************************************************************************