*------------------------------------------------------------------------------
* Project.........: Basis.pjx
* File............: GenDiscCard.prg
* Module/Procedure: GenDiscCard()
* Called by.......: <NA>
* Parameters......: <none>
* Returns.........: <none>
* Notes...........: Генерирование списка дисконтных карт по таблице DiscCardRange
*------------------------------------------------------------------------------

*09.11.2005 15:20 ->Объявление и инициализация переменных
LOCAL	lcOldAlias, ;
		lnCardCouter, ;
		lcCLU, ;
		lnDiscID
***
lcOldAlias = ALIAS()
*------------------------------------------------------------------------------

*09.11.2005 15:27 ->Откроем таблицу с диапазонами дисконтных карт
IF !USED([DiscCardRange])
	USE DiscCardRange IN 0
ENDIF
*------------------------------------------------------------------------------

*09.11.2005 15:36 ->Заполняем список дисконтных карт
SELECT DiscCardRange
SCAN ALL

	FOR lnCardCounter = 1 TO DiscCardRange.DiscCardRangeMax
		
		*19.11.2005 17:49 ->Сгенерируем номер дисконтной карты
		lcCLU	 = DiscCardRange.DiscCardPrefix + PADL(ALLTRIM(STR(DiscCardRange.DiscCardRangeStartNo + lnCardCounter - 1)),5,[0])
		lnDiscID = DiscCardRange.DiscID
		*------------------------------------------------------------------------------
		
		*19.11.2005 17:49 ->Проверим наличие дисконтной карты
		SELECT ;
			DiscCard.CLU ;
		FROM DiscCard ;
		WHERE ALLTRIM(DiscCard.CLU) == ALLTRIM(lcCLU) ;
		INTO CURSOR curDiscCardExist
		*------------------------------------------------------------------------------
		
		*19.11.2005 17:52 ->Если ДК с таким номером не найдена -> добавляем
		IF _Tally = 0
			INSERT INTO DiscCard (CLU, DiscID) VALUES (lcCLU, lnDiscID)
		ENDIF
		*------------------------------------------------------------------------------
		
	ENDFOR
	SELECT DiscCardRange
	
ENDSCAN
*------------------------------------------------------------------------------

*09.11.2005 15:36 ->Сообщим о завершении генерации
MESSAGEBOX([Список дисконтных карт сгенерирован],64,[Сообщение])
*------------------------------------------------------------------------------
	
*******************************************************************************
******************************** END PROCEDURE ********************************
*******************************************************************************