*-------------------------------------------------------
* Project.........: BASIS.PJX
* File............: MTOW.PRG
* Module/Procedure: MTOW()()
* Called by.......: <NA>
* Parameters......: <tnNumber,tnCurTypeID>
* Returns.........: <none>
* Notes...........: Конвертирование денежной суммы в строковую запись
*-------------------------------------------------------
LPARAMETERS	tnNumber,tnCurTypeID

*20.09.2004 18:11 ->Объявление и инициализация переменных
LOCAL	toNWConv
*------------------------------------------------------------------------------

*20.09.2004 18:11 ->Вызываем метод объекта
IF TYPE([oApp])==[O] AND !ISNULL(oApp)
	toNWConv = oApp.CreateObject([NWConv;String_v1])
	RETURN toNWConv.MTOW(tnNumber,tnCurTypeID)
ELSE
	RETURN [Приложение не запущено. Функция недоступна.]
ENDIF
*------------------------------------------------------------------------------

************************************************************************************
**********************************  END OF METHOD **********************************
************************************************************************************
