*-------------------------------------------------------
* Project.........: BASIS.PJX
* File............: NTOW.PRG
* Module/Procedure: NTOW()()
* Called by.......: <NA>
* Parameters......: <tnNumber[,tcGender[,tcCase]]>
* Returns.........: <none>
* Notes...........: Преобразование числа в строковую запись
*-------------------------------------------------------
LPARAMETERS	tnNumber,tcGender,tcCase

*20.09.2004 18:11 ->Объявление и инициализация переменных
LOCAL	toNWConv
*------------------------------------------------------------------------------

*20.09.2004 18:11 ->Вызываем метод объекта
IF TYPE([oApp])==[O] AND !ISNULL(oApp)
	toNWConv = oApp.CreateObject([NWConv;String_v1])
	RETURN toNWConv.NTOW(tnNumber,tcGender,tcCase)
ELSE
	RETURN [Приложение не запущено. Функция недоступна.]
ENDIF
*------------------------------------------------------------------------------

************************************************************************************
**********************************  END OF METHOD **********************************
************************************************************************************
