*-------------------------------------------------------
* Project.........: Basis.pjx
* File............: Stored Procedures for Basis
* Module/Procedure: spGetTmpValueList()
* Called by.......: <N/A>
* Parameters......: <tcIDTableNM>
* Returns.........: <lcValueList>
* Notes...........: Получение списка значений идентификаторов из временной таблицы
*------------------------------------------------------------------------------
PROCEDURE spGetTmpValueList
LPARAMETERS tcIDTableNM

*10.04.2006 11:42 -> Объявление и инициализация переменных
LOCAL	luValue, ;
		lcValueList
*------------------------------------------------------------------------------

*10.04.2006 11:30 -> Откроем временную таблицу
IF !USED(tcIDTableNM)
	USE (tcIDTableNM) IN 0
ENDIF
*------------------------------------------------------------------------------

*10.04.2006 11:34 -> Сформируем список значений идентификаторов
SELECT (tcIDTableNM)
lcValueList = []
***
SCAN ALL
	luValue = EVALUATE(tcIDTableNM + [.ID])
	IF TYPE([luValue]) == [N] AND !ISNULL(luValue)
		lcValueList = lcValueList + ALLTRIM(STR(luValue)) + [,]
	ENDIF
ENDSCAN
***
lcValueList = LEFT(lcValueList,LEN(lcValueList)-1)
*------------------------------------------------------------------------------

*10.04.2006 11:35 -> Закроем временную таблицу
USE IN SELECT(tcIDTableNM)
*------------------------------------------------------------------------------

*10.04.2006 11:45 -> Вернем результат
RETURN lcValueList
*------------------------------------------------------------------------------

ENDPROC 
*******************************************************************************
******************************** END PROCEDURE ********************************
*******************************************************************************
