*-------------------------------------------------------
* Project.........: Basis.pjx
* File............: Stored Procedures for Basis
* Module/Procedure: spInventoryBludo()
* Called by.......: <NA>
* Parameters......: <tnFrmID>
* Returns.........: <Кол-во подблюд (блюд содержащихся в блюдах)>
* Notes...........: Разворачивает блюда по ингридиентам
*------------------------------------------------------------------------------
PROCEDURE spInventoryBludo
LPARAMETERS tnFrmID

*19.06.2006 12:23 ->Объявление и инициализация переменных
LOCAL   lnConnectHandle, ;
		lnSqlExeResult, ;
		lnRecCnt
*------------------------------------------------------------------------------

*06.12.2006 12:12 ->Покажем сообщение для пользователя
WAIT WINDOW [Ждите. Идет обработка данных...] NOWAIT NOCLEAR
SET MESSAGE TO [Ждите. Идет обработка данных...]
*------------------------------------------------------------------------------

*07.04.2006 16:13 -> Коннектимся к БД через существующее соединение
lnConnectHandle = SQLCONNECT(pcvCONNECTIONNAME)
*------------------------------------------------------------------------------

*07.04.2006 16:45 -> Выполняем запрос
lnSqlExeResult = 0
***
DO WHILE (lnSqlExeResult = 0) AND (lnSqlExeResult # -1)
	lnSqlExeResult = SQLEXEC(lnConnectHandle, ;
		[SET LOCK_TIMEOUT ] + pcvLOCKTIMEOUT + [ ] + ;
		[EXECUTE spInventoryBludo ?tnFrmID],[curTmp])
ENDDO
***
IF lnSqlExeResult = -1
	spHandleODBCError()
	RETURN
ENDIF
***
lnRecCnt = curTmp.RecCnt
*------------------------------------------------------------------------------

*07.04.2006 16:12 -> Делаем дисконнект: освобождаем соединение
SQLDISCONNECT(lnConnectHandle)
*------------------------------------------------------------------------------

*06.12.2006 12:13 ->Уберем сообщение
WAIT CLEAR
SET MESSAGE TO []
*------------------------------------------------------------------------------

*20.06.2006 12:39 -> Вывод сообщения пользователю
MESSAGEBOX([Обработка документа успешно завершена.],64,[Информация])
*------------------------------------------------------------------------------

*19.06.2006 12:30 -> Вернем результат
RETURN .T.
*------------------------------------------------------------------------------

************************************************************************************
**********************************  END PROCEDURE **********************************
************************************************************************************

*******************************************************************************
* Процедуры для работы с наборами товаров
PROCEDURE ________TOVAR_SET_PROCEDURES________
ENDPROC 
*******************************************************************************
******************************** END PROCEDURE ********************************
*******************************************************************************
